"""
Задача №2.
Дано два чотирицифрових числа a і b.
Виведіть усі чотирицифрові числа на відрізку від a до b,
які є паліндромами (читаються однаково як зліва направо, так і справа наліво).
Автор: Мотовилець Марія
"""
# Зчитуємо числа a і b з вводу
a = int(input("Введіть перше чотирицифрове число (a): "))
b = int(input("Введіть друге чотирицифрове число (b): "))

for i in range(a, b + 1):
    n = str(i)
    n1 = n[::-1]
    
    if n == n1:
        print(i)
