"""

Задача №1.
Послідовність складається з натуральних чисел і завершується числом 0.
Визначте значення найбільшого елемента послідовності.
Вводиться послідовність цілих чисел, що закінчується числом 0
(саме число 0 в послідовність не входить,
а використовується як ознака її закінчення).
Автор: Мотовилець Марія

"""

n = 0

while True:
    num = int(input("Введіть число (0 для завершення): "))
    if num == 0:
        break  
    else:
        if num > n:
            n = num  

print(f"Найбільше число у послідовності: {n}")
